JunhuanLi/mowerautosaved/Automower/Code/Navigation/导航代码_ekf12_m/slprj/_sfprj/STM32_UART_Receiver/_self/sfun/src/c1_STM32_UART_Receiver.c
/* Include files */

#include "STM32_UART_Receiver_sfun.h"
#include "c1_STM32_UART_Receiver.h"
#include <string.h>
#define CHARTINSTANCE_CHARTNUMBER      (chartInstance->chartNumber)
#define CHARTINSTANCE_INSTANCENUMBER   (chartInstance->instanceNumber)
#include "STM32_UART_Receiver_sfun_debug_macros.h"
#define _SF_MEX_LISTEN_FOR_CTRL_C(S)   sf_mex_listen_for_ctrl_c_with_debugger(S, sfGlobalDebugInstanceStruct);

static void chart_debug_initialization(SimStruct *S, unsigned int
  fullDebuggerInitialization);
static void chart_debug_initialize_data_addresses(SimStruct *S);
static const mxArray* sf_opaque_get_hover_data_for_msg(void *chartInstance,
  int32_T msgSSID);

/* Type Definitions */

/* Named Constants */
#define CALL_EVENT                     (-1)

/* Variable Declarations */

/* Variable Definitions */
static real_T _sfTime_;
static const char * c1_debug_family_names[4] = { "nargin", "nargout", "u", "y" };

/* Function Declarations */
static void initialize_c1_STM32_UART_Receiver
  (SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance);
static void initialize_params_c1_STM32_UART_Receiver
  (SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance);
static void enable_c1_STM32_UART_Receiver(SFc1_STM32_UART_ReceiverInstanceStruct
  *chartInstance);
static void disable_c1_STM32_UART_Receiver
  (SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance);
static void c1_update_debugger_state_c1_STM32_UART_Receiver
  (SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance);
static const mxArray *get_sim_state_c1_STM32_UART_Receiver
  (SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance);
static void set_sim_state_c1_STM32_UART_Receiver
  (SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance, const mxArray *c1_st);
static void finalize_c1_STM32_UART_Receiver
  (SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance);
static void sf_gateway_c1_STM32_UART_Receiver
  (SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance);
static void mdl_start_c1_STM32_UART_Receiver
  (SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance);
static void initSimStructsc1_STM32_UART_Receiver
  (SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance);
static void init_script_number_translation(uint32_T c1_machineNumber, uint32_T
  c1_chartNumber, uint32_T c1_instanceNumber);
static const mxArray *c1_sf_marshallOut(void *chartInstanceVoid, void *c1_inData);
static void c1_emlrt_marshallIn(SFc1_STM32_UART_ReceiverInstanceStruct
  *chartInstance, const mxArray *c1_b_y, const char_T *c1_identifier, real_T
  c1_c_y[25]);
static void c1_b_emlrt_marshallIn(SFc1_STM32_UART_ReceiverInstanceStruct
  *chartInstance, const mxArray *c1_b_u, const emlrtMsgIdentifier *c1_parentId,
  real_T c1_b_y[25]);
static void c1_sf_marshallIn(void *chartInstanceVoid, const mxArray
  *c1_mxArrayInData, const char_T *c1_varName, void *c1_outData);
static const mxArray *c1_b_sf_marshallOut(void *chartInstanceVoid, void
  *c1_inData);
static const mxArray *c1_c_sf_marshallOut(void *chartInstanceVoid, void
  *c1_inData);
static real_T c1_c_emlrt_marshallIn(SFc1_STM32_UART_ReceiverInstanceStruct
  *chartInstance, const mxArray *c1_b_u, const emlrtMsgIdentifier *c1_parentId);
static void c1_b_sf_marshallIn(void *chartInstanceVoid, const mxArray
  *c1_mxArrayInData, const char_T *c1_varName, void *c1_outData);
static const mxArray *c1_d_sf_marshallOut(void *chartInstanceVoid, void
  *c1_inData);
static int32_T c1_d_emlrt_marshallIn(SFc1_STM32_UART_ReceiverInstanceStruct
  *chartInstance, const mxArray *c1_b_u, const emlrtMsgIdentifier *c1_parentId);
static void c1_c_sf_marshallIn(void *chartInstanceVoid, const mxArray
  *c1_mxArrayInData, const char_T *c1_varName, void *c1_outData);
static uint8_T c1_e_emlrt_marshallIn(SFc1_STM32_UART_ReceiverInstanceStruct
  *chartInstance, const mxArray *c1_b_is_active_c1_STM32_UART_Receiver, const
  char_T *c1_identifier);
static uint8_T c1_f_emlrt_marshallIn(SFc1_STM32_UART_ReceiverInstanceStruct
  *chartInstance, const mxArray *c1_b_u, const emlrtMsgIdentifier *c1_parentId);
static void init_dsm_address_info(SFc1_STM32_UART_ReceiverInstanceStruct
  *chartInstance);
static void init_simulink_io_address(SFc1_STM32_UART_ReceiverInstanceStruct
  *chartInstance);

/* Function Definitions */
static void initialize_c1_STM32_UART_Receiver
  (SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance)
{
  if (sf_is_first_init_cond(chartInstance->S)) {
    initSimStructsc1_STM32_UART_Receiver(chartInstance);
    chart_debug_initialize_data_addresses(chartInstance->S);
  }

  chartInstance->c1_sfEvent = CALL_EVENT;
  _sfTime_ = sf_get_time(chartInstance->S);
  chartInstance->c1_is_active_c1_STM32_UART_Receiver = 0U;
}

static void initialize_params_c1_STM32_UART_Receiver
  (SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance)
{
  (void)chartInstance;
}

static void enable_c1_STM32_UART_Receiver(SFc1_STM32_UART_ReceiverInstanceStruct
  *chartInstance)
{
  _sfTime_ = sf_get_time(chartInstance->S);
}

static void disable_c1_STM32_UART_Receiver
  (SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance)
{
  _sfTime_ = sf_get_time(chartInstance->S);
}

static void c1_update_debugger_state_c1_STM32_UART_Receiver
  (SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance)
{
  (void)chartInstance;
}

static const mxArray *get_sim_state_c1_STM32_UART_Receiver
  (SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance)
{
  const mxArray *c1_st;
  const mxArray *c1_b_y = NULL;
  const mxArray *c1_c_y = NULL;
  uint8_T c1_hoistedGlobal;
  const mxArray *c1_d_y = NULL;
  c1_st = NULL;
  c1_st = NULL;
  c1_b_y = NULL;
  sf_mex_assign(&c1_b_y, sf_mex_createcellmatrix(2, 1), false);
  c1_c_y = NULL;
  sf_mex_assign(&c1_c_y, sf_mex_create("y", *chartInstance->c1_y, 0, 0U, 1U, 0U,
    1, 25), false);
  sf_mex_setcell(c1_b_y, 0, c1_c_y);
  c1_hoistedGlobal = chartInstance->c1_is_active_c1_STM32_UART_Receiver;
  c1_d_y = NULL;
  sf_mex_assign(&c1_d_y, sf_mex_create("y", &c1_hoistedGlobal, 3, 0U, 0U, 0U, 0),
                false);
  sf_mex_setcell(c1_b_y, 1, c1_d_y);
  sf_mex_assign(&c1_st, c1_b_y, false);
  return c1_st;
}

