JunhuanLi/mowerautosaved/Automower/Code/Navigation/导航代码_ekf12_m/slprj/_sfprj/STM32_UART_Receiver/_self/sfun/src/c1_STM32_UART_Receiver.c
static void set_sim_state_c1_STM32_UART_Receiver
  (SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance, const mxArray *c1_st)
{
  const mxArray *c1_b_u;
  real_T c1_dv0[25];
  int32_T c1_i0;
  chartInstance->c1_doneDoubleBufferReInit = true;
  c1_b_u = sf_mex_dup(c1_st);
  c1_emlrt_marshallIn(chartInstance, sf_mex_dup(sf_mex_getcell("y", c1_b_u, 0)),
                      "y", c1_dv0);
  for (c1_i0 = 0; c1_i0 < 25; c1_i0++) {
    (*chartInstance->c1_y)[c1_i0] = c1_dv0[c1_i0];
  }

  chartInstance->c1_is_active_c1_STM32_UART_Receiver = c1_e_emlrt_marshallIn
    (chartInstance, sf_mex_dup(sf_mex_getcell("is_active_c1_STM32_UART_Receiver",
       c1_b_u, 1)), "is_active_c1_STM32_UART_Receiver");
  sf_mex_destroy(&c1_b_u);
  c1_update_debugger_state_c1_STM32_UART_Receiver(chartInstance);
  sf_mex_destroy(&c1_st);
}

static void finalize_c1_STM32_UART_Receiver
  (SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance)
{
  (void)chartInstance;
}

static void sf_gateway_c1_STM32_UART_Receiver
  (SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance)
{
  int32_T c1_i1;
  int32_T c1_i2;
  uint32_T c1_debug_family_var_map[4];
  uint8_T c1_b_u[65];
  real_T c1_nargin = 1.0;
  real_T c1_nargout = 1.0;
  real_T c1_b_y[25];
  int32_T c1_i3;
  uint8_T c1_x[4];
  int32_T c1_c_y;
  real_T c1_A;
  real_T c1_b_x;
  real_T c1_c_x;
  real_T c1_d_y;
  real_T c1_b_A;
  real_T c1_d_x;
  real_T c1_e_x;
  real_T c1_e_y;
  int32_T c1_f_y;
  real_T c1_c_A;
  real_T c1_f_x;
  real_T c1_g_x;
  real_T c1_g_y;
  real_T c1_d_A;
  real_T c1_h_x;
  real_T c1_i_x;
  real_T c1_h_y;
  int32_T c1_i_y;
  uint8_T c1_j_x[2];
  uint16_T c1_j_y;
  uint16_T c1_k_y;
  uint16_T c1_l_y;
  int32_T c1_m_y;
  int32_T c1_n_y;
  int32_T c1_o_y;
  int16_T c1_p_y;
  real_T c1_e_A;
  real_T c1_k_x;
  real_T c1_l_x;
  real_T c1_q_y;
  int16_T c1_r_y;
  real_T c1_f_A;
  real_T c1_m_x;
  real_T c1_n_x;
  real_T c1_s_y;
  int16_T c1_t_y;
  real_T c1_g_A;
  real_T c1_o_x;
  real_T c1_p_x;
  real_T c1_u_y;
  int16_T c1_v_y;
  real_T c1_h_A;
  real_T c1_q_x;
  real_T c1_r_x;
  real_T c1_w_y;
  real_T c1_i_A;
  real_T c1_s_x;
  real_T c1_t_x;
  real_T c1_x_y;
  int16_T c1_y_y;
  real_T c1_j_A;
  real_T c1_u_x;
  real_T c1_v_x;
  real_T c1_ab_y;
  real_T c1_k_A;
  real_T c1_w_x;
  real_T c1_x_x;
  real_T c1_bb_y;
  int16_T c1_cb_y;
  real_T c1_l_A;
  real_T c1_y_x;
  real_T c1_ab_x;
  real_T c1_db_y;
  real_T c1_m_A;
  real_T c1_bb_x;
  real_T c1_cb_x;
  real_T c1_eb_y;
  int16_T c1_fb_y;
  int16_T c1_gb_y;
  int16_T c1_hb_y;
  int16_T c1_ib_y;
  real_T c1_n_A;
  real_T c1_db_x;
  real_T c1_eb_x;
  real_T c1_jb_y;
  int16_T c1_kb_y;
  real_T c1_o_A;
  real_T c1_fb_x;
  real_T c1_gb_x;
  real_T c1_lb_y;
  int16_T c1_mb_y;
  real_T c1_p_A;
  real_T c1_hb_x;
  real_T c1_ib_x;
  real_T c1_nb_y;
  int32_T c1_ob_y;
  uint16_T c1_pb_y;
  int32_T c1_i4;
  int32_T c1_i5;
  _SFD_SYMBOL_SCOPE_PUSH(0U, 0U);
  _sfTime_ = sf_get_time(chartInstance->S);
  _SFD_CC_CALL(CHART_ENTER_SFUNCTION_TAG, 0U, chartInstance->c1_sfEvent);
  for (c1_i1 = 0; c1_i1 < 65; c1_i1++) {
    _SFD_DATA_RANGE_CHECK((real_T)(*chartInstance->c1_u)[c1_i1], 0U, 1U, 0U,
                          chartInstance->c1_sfEvent, false);
  }

  chartInstance->c1_sfEvent = CALL_EVENT;
  _SFD_CC_CALL(CHART_ENTER_DURING_FUNCTION_TAG, 0U, chartInstance->c1_sfEvent);
  for (c1_i2 = 0; c1_i2 < 65; c1_i2++) {
    c1_b_u[c1_i2] = (*chartInstance->c1_u)[c1_i2];
  }

  _SFD_SYMBOL_SCOPE_PUSH_EML(0U, 4U, 4U, c1_debug_family_names,
    c1_debug_family_var_map);
  _SFD_SYMBOL_SCOPE_ADD_EML_IMPORTABLE(&c1_nargin, 0U, c1_c_sf_marshallOut,
    c1_b_sf_marshallIn);
  _SFD_SYMBOL_SCOPE_ADD_EML_IMPORTABLE(&c1_nargout, 1U, c1_c_sf_marshallOut,
    c1_b_sf_marshallIn);
  _SFD_SYMBOL_SCOPE_ADD_EML(c1_b_u, 2U, c1_b_sf_marshallOut);
  _SFD_SYMBOL_SCOPE_ADD_EML_IMPORTABLE(c1_b_y, 3U, c1_sf_marshallOut,
    c1_sf_marshallIn);
  CV_EML_FCN(0, 0);
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 31);
  for (c1_i3 = 0; c1_i3 < 25; c1_i3++) {
    c1_b_y[c1_i3] = 0.0;
  }

  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 32);
  c1_x[0] = c1_b_u[4];
  c1_x[1] = c1_b_u[3];
  c1_x[2] = c1_b_u[2];
  c1_x[3] = c1_b_u[1];
  memcpy((void *)&c1_c_y, (void *)&c1_x[0], (size_t)1 * sizeof(int32_T));
  c1_A = (real_T)c1_c_y;
  c1_b_x = c1_A;
  c1_c_x = c1_b_x;
  c1_d_y = c1_c_x / 1.0E+7;
  c1_b_A = c1_d_y * 3.1415926535897931;
  c1_d_x = c1_b_A;
  c1_e_x = c1_d_x;
  c1_e_y = c1_e_x / 180.0;
  c1_b_y[0] = c1_e_y;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 33);
  c1_x[0] = c1_b_u[8];
  c1_x[1] = c1_b_u[7];
  c1_x[2] = c1_b_u[6];
  c1_x[3] = c1_b_u[5];
  memcpy((void *)&c1_f_y, (void *)&c1_x[0], (size_t)1 * sizeof(int32_T));
  c1_c_A = (real_T)c1_f_y;
  c1_f_x = c1_c_A;
  c1_g_x = c1_f_x;
  c1_g_y = c1_g_x / 1.0E+7;
  c1_d_A = c1_g_y * 3.1415926535897931;
  c1_h_x = c1_d_A;
  c1_i_x = c1_h_x;
  c1_h_y = c1_i_x / 180.0;
  c1_b_y[1] = c1_h_y;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 34);
  c1_b_y[2] = (real_T)c1_b_u[9];
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 35);
  c1_x[0] = c1_b_u[13];
  c1_x[1] = c1_b_u[12];
  c1_x[2] = c1_b_u[11];
  c1_x[3] = c1_b_u[10];
  memcpy((void *)&c1_i_y, (void *)&c1_x[0], (size_t)1 * sizeof(int32_T));
  c1_b_y[3] = (real_T)c1_i_y * 0.001;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 36);
  c1_j_x[0] = c1_b_u[15];
  c1_j_x[1] = c1_b_u[14];
  memcpy((void *)&c1_j_y, (void *)&c1_j_x[0], (size_t)1 * sizeof(uint16_T));
  c1_b_y[4] = (real_T)c1_j_y * 0.001;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 37);
  c1_j_x[0] = c1_b_u[17];
  c1_j_x[1] = c1_b_u[16];
  memcpy((void *)&c1_k_y, (void *)&c1_j_x[0], (size_t)1 * sizeof(uint16_T));
  c1_b_y[5] = (real_T)c1_k_y * 0.001;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 38);
  c1_j_x[0] = c1_b_u[19];
  c1_j_x[1] = c1_b_u[18];
  memcpy((void *)&c1_l_y, (void *)&c1_j_x[0], (size_t)1 * sizeof(uint16_T));
  c1_b_y[6] = (real_T)c1_l_y * 0.001;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 39);
  c1_x[0] = c1_b_u[23];
  c1_x[1] = c1_b_u[22];
  c1_x[2] = c1_b_u[21];
  c1_x[3] = c1_b_u[20];
  memcpy((void *)&c1_m_y, (void *)&c1_x[0], (size_t)1 * sizeof(int32_T));
  c1_b_y[7] = (real_T)c1_m_y * 0.001;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 40);
  c1_x[0] = c1_b_u[27];
  c1_x[1] = c1_b_u[26];
  c1_x[2] = c1_b_u[25];
  c1_x[3] = c1_b_u[24];
  memcpy((void *)&c1_n_y, (void *)&c1_x[0], (size_t)1 * sizeof(int32_T));
  c1_b_y[8] = (real_T)c1_n_y * 0.001;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 41);
  c1_x[0] = c1_b_u[31];
  c1_x[1] = c1_b_u[30];
  c1_x[2] = c1_b_u[29];
  c1_x[3] = c1_b_u[28];
  memcpy((void *)&c1_o_y, (void *)&c1_x[0], (size_t)1 * sizeof(int32_T));
  c1_b_y[9] = (real_T)c1_o_y * 0.001;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 42);
  c1_j_x[0] = c1_b_u[33];
  c1_j_x[1] = c1_b_u[32];
  memcpy((void *)&c1_p_y, (void *)&c1_j_x[0], (size_t)1 * sizeof(int16_T));
  c1_e_A = (real_T)c1_p_y;
  c1_k_x = c1_e_A;
  c1_l_x = c1_k_x;
  c1_q_y = c1_l_x / 16384.0;
  c1_b_y[10] = c1_q_y;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 43);
  c1_j_x[0] = c1_b_u[35];
  c1_j_x[1] = c1_b_u[34];
  memcpy((void *)&c1_r_y, (void *)&c1_j_x[0], (size_t)1 * sizeof(int16_T));
  c1_f_A = (real_T)c1_r_y;
  c1_m_x = c1_f_A;
  c1_n_x = c1_m_x;
  c1_s_y = c1_n_x / 16384.0;
  c1_b_y[11] = c1_s_y;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 44);
  c1_j_x[0] = c1_b_u[37];
  c1_j_x[1] = c1_b_u[36];
  memcpy((void *)&c1_t_y, (void *)&c1_j_x[0], (size_t)1 * sizeof(int16_T));
  c1_g_A = (real_T)c1_t_y;
  c1_o_x = c1_g_A;
  c1_p_x = c1_o_x;
  c1_u_y = c1_p_x / 16384.0;
  c1_b_y[12] = c1_u_y;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 45);
  c1_j_x[0] = c1_b_u[39];
  c1_j_x[1] = c1_b_u[38];
  memcpy((void *)&c1_v_y, (void *)&c1_j_x[0], (size_t)1 * sizeof(int16_T));
  c1_h_A = (real_T)c1_v_y;
  c1_q_x = c1_h_A;
  c1_r_x = c1_q_x;
  c1_w_y = c1_r_x / 16.4;
  c1_i_A = c1_w_y * 3.1415926535897931;
  c1_s_x = c1_i_A;
  c1_t_x = c1_s_x;
  c1_x_y = c1_t_x / 180.0;
  c1_b_y[13] = c1_x_y;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 46);
  c1_j_x[0] = c1_b_u[41];
  c1_j_x[1] = c1_b_u[40];
  memcpy((void *)&c1_y_y, (void *)&c1_j_x[0], (size_t)1 * sizeof(int16_T));
  c1_j_A = (real_T)c1_y_y;
  c1_u_x = c1_j_A;
  c1_v_x = c1_u_x;
  c1_ab_y = c1_v_x / 16.4;
  c1_k_A = c1_ab_y * 3.1415926535897931;
  c1_w_x = c1_k_A;
  c1_x_x = c1_w_x;
  c1_bb_y = c1_x_x / 180.0;
  c1_b_y[14] = c1_bb_y;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 47);
  c1_j_x[0] = c1_b_u[43];
  c1_j_x[1] = c1_b_u[42];
  memcpy((void *)&c1_cb_y, (void *)&c1_j_x[0], (size_t)1 * sizeof(int16_T));
  c1_l_A = (real_T)c1_cb_y;
  c1_y_x = c1_l_A;
  c1_ab_x = c1_y_x;
  c1_db_y = c1_ab_x / 16.4;
  c1_m_A = c1_db_y * 3.1415926535897931;
  c1_bb_x = c1_m_A;
  c1_cb_x = c1_bb_x;
  c1_eb_y = c1_cb_x / 180.0;
  c1_b_y[15] = c1_eb_y;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 48);
  c1_j_x[0] = c1_b_u[45];
  c1_j_x[1] = c1_b_u[44];
  memcpy((void *)&c1_fb_y, (void *)&c1_j_x[0], (size_t)1 * sizeof(int16_T));
  c1_b_y[16] = (real_T)c1_fb_y;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 49);
  c1_j_x[0] = c1_b_u[47];
  c1_j_x[1] = c1_b_u[46];
  memcpy((void *)&c1_gb_y, (void *)&c1_j_x[0], (size_t)1 * sizeof(int16_T));
  c1_b_y[17] = (real_T)c1_gb_y;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 50);
  c1_j_x[0] = c1_b_u[49];
  c1_j_x[1] = c1_b_u[48];
  memcpy((void *)&c1_hb_y, (void *)&c1_j_x[0], (size_t)1 * sizeof(int16_T));
  c1_b_y[18] = (real_T)c1_hb_y;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 51);
  c1_j_x[0] = c1_b_u[51];
  c1_j_x[1] = c1_b_u[50];
  memcpy((void *)&c1_ib_y, (void *)&c1_j_x[0], (size_t)1 * sizeof(int16_T));
  c1_n_A = (real_T)c1_ib_y * 0.01 * 3.1415926535897931;
  c1_db_x = c1_n_A;
  c1_eb_x = c1_db_x;
  c1_jb_y = c1_eb_x / 180.0;
  c1_b_y[19] = c1_jb_y;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 52);
  c1_j_x[0] = c1_b_u[53];
  c1_j_x[1] = c1_b_u[52];
  memcpy((void *)&c1_kb_y, (void *)&c1_j_x[0], (size_t)1 * sizeof(int16_T));
  c1_o_A = (real_T)c1_kb_y * 0.01 * 3.1415926535897931;
  c1_fb_x = c1_o_A;
  c1_gb_x = c1_fb_x;
  c1_lb_y = c1_gb_x / 180.0;
  c1_b_y[20] = c1_lb_y;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 53);
  c1_j_x[0] = c1_b_u[55];
  c1_j_x[1] = c1_b_u[54];
  memcpy((void *)&c1_mb_y, (void *)&c1_j_x[0], (size_t)1 * sizeof(int16_T));
  c1_p_A = (real_T)c1_mb_y * 0.01 * 3.1415926535897931;
  c1_hb_x = c1_p_A;
  c1_ib_x = c1_hb_x;
  c1_nb_y = c1_ib_x / 180.0;
  c1_b_y[21] = c1_nb_y;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 54);
  c1_b_y[22] = (real_T)c1_b_u[56];
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 55);
  c1_x[0] = c1_b_u[60];
  c1_x[1] = c1_b_u[59];
  c1_x[2] = c1_b_u[58];
  c1_x[3] = c1_b_u[57];
  memcpy((void *)&c1_ob_y, (void *)&c1_x[0], (size_t)1 * sizeof(int32_T));
  c1_b_y[23] = (real_T)c1_ob_y * 1.0E-5;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, 56);
  c1_j_x[0] = c1_b_u[62];
  c1_j_x[1] = c1_b_u[61];
  memcpy((void *)&c1_pb_y, (void *)&c1_j_x[0], (size_t)1 * sizeof(uint16_T));
  c1_b_y[24] = (real_T)c1_pb_y * 1.0E-5;
  _SFD_EML_CALL(0U, chartInstance->c1_sfEvent, -56);
  _SFD_SYMBOL_SCOPE_POP();
  for (c1_i4 = 0; c1_i4 < 25; c1_i4++) {
    (*chartInstance->c1_y)[c1_i4] = c1_b_y[c1_i4];
  }

  _SFD_CC_CALL(EXIT_OUT_OF_FUNCTION_TAG, 0U, chartInstance->c1_sfEvent);
  _SFD_SYMBOL_SCOPE_POP();
  _SFD_CHECK_FOR_STATE_INCONSISTENCY(_STM32_UART_ReceiverMachineNumber_,
    chartInstance->chartNumber, chartInstance->instanceNumber);
  for (c1_i5 = 0; c1_i5 < 25; c1_i5++) {
    _SFD_DATA_RANGE_CHECK((*chartInstance->c1_y)[c1_i5], 1U, 1U, 0U,
                          chartInstance->c1_sfEvent, false);
  }
}

static void mdl_start_c1_STM32_UART_Receiver
  (SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance)
{
  (void)chartInstance;
}

static void initSimStructsc1_STM32_UART_Receiver
  (SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance)
{
  (void)chartInstance;
}

static void init_script_number_translation(uint32_T c1_machineNumber, uint32_T
  c1_chartNumber, uint32_T c1_instanceNumber)
{
  (void)(c1_machineNumber);
  (void)(c1_chartNumber);
  (void)(c1_instanceNumber);
}

static const mxArray *c1_sf_marshallOut(void *chartInstanceVoid, void *c1_inData)
{
  const mxArray *c1_mxArrayOutData;
  int32_T c1_i6;
  const mxArray *c1_b_y = NULL;
  real_T c1_b_u[25];
  SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance;
  chartInstance = (SFc1_STM32_UART_ReceiverInstanceStruct *)chartInstanceVoid;
  c1_mxArrayOutData = NULL;
  c1_mxArrayOutData = NULL;
  for (c1_i6 = 0; c1_i6 < 25; c1_i6++) {
    c1_b_u[c1_i6] = (*(real_T (*)[25])c1_inData)[c1_i6];
  }

  c1_b_y = NULL;
  sf_mex_assign(&c1_b_y, sf_mex_create("y", c1_b_u, 0, 0U, 1U, 0U, 1, 25), false);
  sf_mex_assign(&c1_mxArrayOutData, c1_b_y, false);
  return c1_mxArrayOutData;
}

static void c1_emlrt_marshallIn(SFc1_STM32_UART_ReceiverInstanceStruct
  *chartInstance, const mxArray *c1_b_y, const char_T *c1_identifier, real_T
  c1_c_y[25])
{
  emlrtMsgIdentifier c1_thisId;
  c1_thisId.fIdentifier = (const char *)c1_identifier;
  c1_thisId.fParent = NULL;
  c1_thisId.bParentIsCell = false;
  c1_b_emlrt_marshallIn(chartInstance, sf_mex_dup(c1_b_y), &c1_thisId, c1_c_y);
  sf_mex_destroy(&c1_b_y);
}

static void c1_b_emlrt_marshallIn(SFc1_STM32_UART_ReceiverInstanceStruct
  *chartInstance, const mxArray *c1_b_u, const emlrtMsgIdentifier *c1_parentId,
  real_T c1_b_y[25])
{
  real_T c1_dv1[25];
  int32_T c1_i7;
  (void)chartInstance;
  sf_mex_import(c1_parentId, sf_mex_dup(c1_b_u), c1_dv1, 1, 0, 0U, 1, 0U, 1, 25);
  for (c1_i7 = 0; c1_i7 < 25; c1_i7++) {
    c1_b_y[c1_i7] = c1_dv1[c1_i7];
  }

  sf_mex_destroy(&c1_b_u);
}

static void c1_sf_marshallIn(void *chartInstanceVoid, const mxArray
  *c1_mxArrayInData, const char_T *c1_varName, void *c1_outData)
{
  const mxArray *c1_b_y;
  const char_T *c1_identifier;
  emlrtMsgIdentifier c1_thisId;
  real_T c1_c_y[25];
  int32_T c1_i8;
  SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance;
  chartInstance = (SFc1_STM32_UART_ReceiverInstanceStruct *)chartInstanceVoid;
  c1_b_y = sf_mex_dup(c1_mxArrayInData);
  c1_identifier = c1_varName;
  c1_thisId.fIdentifier = (const char *)c1_identifier;
  c1_thisId.fParent = NULL;
  c1_thisId.bParentIsCell = false;
  c1_b_emlrt_marshallIn(chartInstance, sf_mex_dup(c1_b_y), &c1_thisId, c1_c_y);
  sf_mex_destroy(&c1_b_y);
  for (c1_i8 = 0; c1_i8 < 25; c1_i8++) {
    (*(real_T (*)[25])c1_outData)[c1_i8] = c1_c_y[c1_i8];
  }

