JunhuanLi/mowerautosaved/Automower/Code/Navigation/导航代码_ekf12_m/slprj/_sfprj/STM32_UART_Receiver/_self/sfun/src/c1_STM32_UART_Receiver.c
        _SFD_CV_INIT_TRANS(0,0,NULL,NULL,0,NULL);

        /* Initialization of MATLAB Function Model Coverage */
        _SFD_CV_INIT_EML(0,1,1,0,0,0,0,0,0,0,0,0);
        _SFD_CV_INIT_EML_FCN(0,0,"eML_blk_kernel",2044,-1,4418);

        {
          unsigned int dimVector[2];
          dimVector[0]= 1U;
          dimVector[1]= 65U;
          _SFD_SET_DATA_COMPILED_PROPS(0,SF_UINT8,2,&(dimVector[0]),0,0,0,0.0,
            1.0,0,0,(MexFcnForType)c1_b_sf_marshallOut,(MexInFcnForType)NULL);
        }

        {
          unsigned int dimVector[1];
          dimVector[0]= 25U;
          _SFD_SET_DATA_COMPILED_PROPS(1,SF_DOUBLE,1,&(dimVector[0]),0,0,0,0.0,
            1.0,0,0,(MexFcnForType)c1_sf_marshallOut,(MexInFcnForType)
            c1_sf_marshallIn);
        }
      }
    } else {
      sf_debug_reset_current_state_configuration(sfGlobalDebugInstanceStruct,
        _STM32_UART_ReceiverMachineNumber_,chartInstance->chartNumber,
        chartInstance->instanceNumber);
    }
  }
}

static void chart_debug_initialize_data_addresses(SimStruct *S)
{
  if (!sim_mode_is_rtw_gen(S)) {
    SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance =
      (SFc1_STM32_UART_ReceiverInstanceStruct *)sf_get_chart_instance_ptr(S);
    if (ssIsFirstInitCond(S)) {
      /* do this only if simulation is starting and after we know the addresses of all data */
      {
        _SFD_SET_DATA_VALUE_PTR(0U, (void *)chartInstance->c1_u);
        _SFD_SET_DATA_VALUE_PTR(1U, (void *)chartInstance->c1_y);
      }
    }
  }
}

static const char* sf_get_instance_specialization(void)
{
  return "s3r7GeY6o8vlSJEvSJRM6nE";
}

static void sf_opaque_initialize_c1_STM32_UART_Receiver(void *chartInstanceVar)
{
  chart_debug_initialization(((SFc1_STM32_UART_ReceiverInstanceStruct*)
    chartInstanceVar)->S,0);
  initialize_params_c1_STM32_UART_Receiver
    ((SFc1_STM32_UART_ReceiverInstanceStruct*) chartInstanceVar);
  initialize_c1_STM32_UART_Receiver((SFc1_STM32_UART_ReceiverInstanceStruct*)
    chartInstanceVar);
}

static void sf_opaque_enable_c1_STM32_UART_Receiver(void *chartInstanceVar)
{
  enable_c1_STM32_UART_Receiver((SFc1_STM32_UART_ReceiverInstanceStruct*)
    chartInstanceVar);
}

static void sf_opaque_disable_c1_STM32_UART_Receiver(void *chartInstanceVar)
{
  disable_c1_STM32_UART_Receiver((SFc1_STM32_UART_ReceiverInstanceStruct*)
    chartInstanceVar);
}

static void sf_opaque_gateway_c1_STM32_UART_Receiver(void *chartInstanceVar)
{
  sf_gateway_c1_STM32_UART_Receiver((SFc1_STM32_UART_ReceiverInstanceStruct*)
    chartInstanceVar);
}

static const mxArray* sf_opaque_get_sim_state_c1_STM32_UART_Receiver(SimStruct*
  S)
{
  return get_sim_state_c1_STM32_UART_Receiver
    ((SFc1_STM32_UART_ReceiverInstanceStruct *)sf_get_chart_instance_ptr(S));/* raw sim ctx */
}

static void sf_opaque_set_sim_state_c1_STM32_UART_Receiver(SimStruct* S, const
  mxArray *st)
{
  set_sim_state_c1_STM32_UART_Receiver((SFc1_STM32_UART_ReceiverInstanceStruct*)
    sf_get_chart_instance_ptr(S), st);
}

static void sf_opaque_terminate_c1_STM32_UART_Receiver(void *chartInstanceVar)
{
  if (chartInstanceVar!=NULL) {
    SimStruct *S = ((SFc1_STM32_UART_ReceiverInstanceStruct*) chartInstanceVar
      )->S;
    if (sim_mode_is_rtw_gen(S) || sim_mode_is_external(S)) {
      sf_clear_rtw_identifier(S);
      unload_STM32_UART_Receiver_optimization_info();
    }

    finalize_c1_STM32_UART_Receiver((SFc1_STM32_UART_ReceiverInstanceStruct*)
      chartInstanceVar);
    utFree(chartInstanceVar);
    if (ssGetUserData(S)!= NULL) {
      sf_free_ChartRunTimeInfo(S);
    }

    ssSetUserData(S,NULL);
  }
}

static void sf_opaque_init_subchart_simstructs(void *chartInstanceVar)
{
  initSimStructsc1_STM32_UART_Receiver((SFc1_STM32_UART_ReceiverInstanceStruct*)
    chartInstanceVar);
}

extern unsigned int sf_machine_global_initializer_called(void);
static void mdlProcessParameters_c1_STM32_UART_Receiver(SimStruct *S)
{
  int i;
  for (i=0;i<ssGetNumRunTimeParams(S);i++) {
    if (ssGetSFcnParamTunable(S,i)) {
      ssUpdateDlgParamAsRunTimeParam(S,i);
    }
  }

  if (sf_machine_global_initializer_called()) {
    initialize_params_c1_STM32_UART_Receiver
      ((SFc1_STM32_UART_ReceiverInstanceStruct*)sf_get_chart_instance_ptr(S));
  }
}

static void mdlSetWorkWidths_c1_STM32_UART_Receiver(SimStruct *S)
{
  /* Set overwritable ports for inplace optimization */
  ssSetStatesModifiedOnlyInUpdate(S, 1);
  ssMdlUpdateIsEmpty(S, 1);
  if (sim_mode_is_rtw_gen(S) || sim_mode_is_external(S)) {
    mxArray *infoStruct = load_STM32_UART_Receiver_optimization_info
      (sim_mode_is_rtw_gen(S), sim_mode_is_modelref_sim(S), sim_mode_is_external
       (S));
    int_T chartIsInlinable =
      (int_T)sf_is_chart_inlinable(sf_get_instance_specialization(),infoStruct,1);
    ssSetStateflowIsInlinable(S,chartIsInlinable);
    ssSetRTWCG(S,1);
    ssSetEnableFcnIsTrivial(S,1);
    ssSetDisableFcnIsTrivial(S,1);
    ssSetNotMultipleInlinable(S,sf_rtw_info_uint_prop
      (sf_get_instance_specialization(),infoStruct,1,
       "gatewayCannotBeInlinedMultipleTimes"));
    sf_set_chart_accesses_machine_info(S, sf_get_instance_specialization(),
      infoStruct, 1);
    sf_update_buildInfo(S, sf_get_instance_specialization(),infoStruct,1);
    if (chartIsInlinable) {
      ssSetInputPortOptimOpts(S, 0, SS_REUSABLE_AND_LOCAL);
      sf_mark_chart_expressionable_inputs(S,sf_get_instance_specialization(),
        infoStruct,1,1);
      sf_mark_chart_reusable_outputs(S,sf_get_instance_specialization(),
        infoStruct,1,1);
    }

    {
      unsigned int outPortIdx;
      for (outPortIdx=1; outPortIdx<=1; ++outPortIdx) {
        ssSetOutputPortOptimizeInIR(S, outPortIdx, 1U);
      }
    }

    {
      unsigned int inPortIdx;
      for (inPortIdx=0; inPortIdx < 1; ++inPortIdx) {
        ssSetInputPortOptimizeInIR(S, inPortIdx, 1U);
      }
    }

    sf_set_rtw_dwork_info(S,sf_get_instance_specialization(),infoStruct,1);
    sf_register_codegen_names_for_scoped_functions_defined_by_chart(S);
    ssSetHasSubFunctions(S,!(chartIsInlinable));
  } else {
  }

  ssSetOptions(S,ssGetOptions(S)|SS_OPTION_WORKS_WITH_CODE_REUSE);
  ssSetChecksum0(S,(3709729038U));
  ssSetChecksum1(S,(2210079673U));
  ssSetChecksum2(S,(740729966U));
  ssSetChecksum3(S,(679989257U));
  ssSetmdlDerivatives(S, NULL);
  ssSetExplicitFCSSCtrl(S,1);
  ssSetStateSemanticsClassicAndSynchronous(S, true);
  ssSupportsMultipleExecInstances(S,1);
}

static void mdlRTW_c1_STM32_UART_Receiver(SimStruct *S)
{
  if (sim_mode_is_rtw_gen(S)) {
    ssWriteRTWStrParam(S, "StateflowChartType", "Embedded MATLAB");
  }
}

static void mdlStart_c1_STM32_UART_Receiver(SimStruct *S)
{
  SFc1_STM32_UART_ReceiverInstanceStruct *chartInstance;
  chartInstance = (SFc1_STM32_UART_ReceiverInstanceStruct *)utMalloc(sizeof
    (SFc1_STM32_UART_ReceiverInstanceStruct));
  if (chartInstance==NULL) {
    sf_mex_error_message("Could not allocate memory for chart instance.");
  }

  memset(chartInstance, 0, sizeof(SFc1_STM32_UART_ReceiverInstanceStruct));
  chartInstance->chartInfo.chartInstance = chartInstance;
  chartInstance->chartInfo.isEMLChart = 1;
  chartInstance->chartInfo.chartInitialized = 0;
  chartInstance->chartInfo.sFunctionGateway =
    sf_opaque_gateway_c1_STM32_UART_Receiver;
  chartInstance->chartInfo.initializeChart =
    sf_opaque_initialize_c1_STM32_UART_Receiver;
  chartInstance->chartInfo.terminateChart =
    sf_opaque_terminate_c1_STM32_UART_Receiver;
  chartInstance->chartInfo.enableChart = sf_opaque_enable_c1_STM32_UART_Receiver;
  chartInstance->chartInfo.disableChart =
    sf_opaque_disable_c1_STM32_UART_Receiver;
  chartInstance->chartInfo.getSimState =
    sf_opaque_get_sim_state_c1_STM32_UART_Receiver;
  chartInstance->chartInfo.setSimState =
    sf_opaque_set_sim_state_c1_STM32_UART_Receiver;
  chartInstance->chartInfo.getSimStateInfo =
    sf_get_sim_state_info_c1_STM32_UART_Receiver;
  chartInstance->chartInfo.zeroCrossings = NULL;
  chartInstance->chartInfo.outputs = NULL;
  chartInstance->chartInfo.derivatives = NULL;
  chartInstance->chartInfo.mdlRTW = mdlRTW_c1_STM32_UART_Receiver;
  chartInstance->chartInfo.mdlStart = mdlStart_c1_STM32_UART_Receiver;
  chartInstance->chartInfo.mdlSetWorkWidths =
    mdlSetWorkWidths_c1_STM32_UART_Receiver;
  chartInstance->chartInfo.callGetHoverDataForMsg = NULL;
  chartInstance->chartInfo.extModeExec = NULL;
  chartInstance->chartInfo.restoreLastMajorStepConfiguration = NULL;
  chartInstance->chartInfo.restoreBeforeLastMajorStepConfiguration = NULL;
  chartInstance->chartInfo.storeCurrentConfiguration = NULL;
  chartInstance->chartInfo.callAtomicSubchartUserFcn = NULL;
  chartInstance->chartInfo.callAtomicSubchartAutoFcn = NULL;
  chartInstance->chartInfo.debugInstance = sfGlobalDebugInstanceStruct;
  chartInstance->S = S;
  sf_init_ChartRunTimeInfo(S, &(chartInstance->chartInfo), false, 0);
  init_dsm_address_info(chartInstance);
  init_simulink_io_address(chartInstance);
  if (!sim_mode_is_rtw_gen(S)) {
  }

  chart_debug_initialization(S,1);
  mdl_start_c1_STM32_UART_Receiver(chartInstance);
}

void c1_STM32_UART_Receiver_method_dispatcher(SimStruct *S, int_T method, void
  *data)
{
  switch (method) {
   case SS_CALL_MDL_START:
    mdlStart_c1_STM32_UART_Receiver(S);
    break;

   case SS_CALL_MDL_SET_WORK_WIDTHS:
    mdlSetWorkWidths_c1_STM32_UART_Receiver(S);
    break;

   case SS_CALL_MDL_PROCESS_PARAMETERS:
    mdlProcessParameters_c1_STM32_UART_Receiver(S);
    break;

   default:
    /* Unhandled method */
    sf_mex_error_message("Stateflow Internal Error:\n"
                         "Error calling c1_STM32_UART_Receiver_method_dispatcher.\n"
                         "Can't handle method %d.\n", method);
    break;
  }
}
